## Plan Result (sbox_appgateway)




<pre><code>Plan: 0 to add, 2 to change, 0 to destroy.</code></pre>

* Update
  * module.appgateway.azurerm_application_gateway.ag[0]
  * module.appgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.appgateway.data.azurerm_monitor_diagnostic_categories.diagnostic_categories[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-sbox-agw"
    }

  # module.appgateway.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-sbox-agw"
        name                              = "aks-fe-00-sbox-agw"
        tags                              = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (7 unchanged attributes hidden)

      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-sbox-agw/backendAddressPools/darts-portal" -> null
          - ip_addresses = [
              - "10.140.31.250",
            ] -> null
          - name         = "darts-portal" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-sbox-agw/backendAddressPools/pip-frontend" -> null
          - ip_addresses = [
              - "10.140.31.250",
            ] -> null
          - name         = "pip-frontend" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-sbox-agw/backendAddressPools/portal-sbox" -> null
          - ip_addresses = [
              - "10.140.31.250",
            ] -> null
          - name         = "portal-sbox" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-sbox-agw/backendAddressPools/pre-portal" -> null
          - ip_addresses = [
              - "10.140.31.250",
            ] -> null
          - name         = "pre-portal" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-sbox-agw/backendAddressPools/sds-api-mgmt" -> null
          - ip_addresses = [
              - "10.140.31.250",
            ] -> null
          - name         = "sds-api-mgmt" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-sbox-agw/backendAddressPools/toffee" -> null
          - ip_addresses = [
              - "10.140.31.250",
            ] -> null
          - name         = "toffee" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-sbox-agw/backendAddressPools/vh-admin-web" -> null
          - ip_addresses = [
              - "10.140.31.250",
            ] -> null
          - name         = "vh-admin-web" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-sbox-agw/backendAddressPools/vh-test-web" -> null
          - ip_addresses = [
              - "10.140.31.250",
            ] -> null
          - name         = "vh-test-web" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-sbox-agw/backendAddressPools/vh-video-web" -> null
          - ip_addresses = [
              - "10.140.31.250",
            ] -> null
          - name         = "vh-video-web" -> null
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.140.15.250",
              + "10.140.31.250",
            ]
          + name         = "darts-portal"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.140.15.250",
              + "10.140.31.250",
            ]
          + name         = "pip-frontend"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.140.15.250",
              + "10.140.31.250",
            ]
          + name         = "portal-sbox"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.140.15.250",
              + "10.140.31.250",
            ]
          + name         = "pre-portal"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.140.15.250",
              + "10.140.31.250",
            ]
          + name         = "sds-api-mgmt"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.140.15.250",
              + "10.140.31.250",
            ]
          + name         = "toffee"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.140.15.250",
              + "10.140.31.250",
            ]
          + name         = "vh-admin-web"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.140.15.250",
              + "10.140.31.250",
            ]
          + name         = "vh-test-web"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.140.15.250",
              + "10.140.31.250",
            ]
          + name         = "vh-video-web"
        }

        # (44 unchanged blocks hidden)
    }

  # module.appgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-sbox-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":544,"Program":"tfcmt","SHA1":"","Target":"sbox_appgateway","Vars":{}} -->